test/Add_Doctor-Combined-JMeter-and-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: Add_Doctor-Selenium
  blazegrid: true
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: Add_Doctor-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  Add_Doctor-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - resizeWindow(1280,871)
      - go(http://localhost:3000/)
      - clickByLinkText(Add Doctor)
      - clickByID(doctorAddress)
      - typeByID(doctorAddress): "0x9bc70e625a73233212F0C146f2A9C78Be6766F69"
      - clickByID(doctorName)
      - typeByID(doctorName): "Name"
      - typeByID(doctorEmail): "mail@mail"
      - typeByID(password): "pass"
      - clickByCSS(button.btn.btn-primary)
      - openWindow()
      - switchWindow(win_ser_1)
      - closeWindow(win_ser_1)
      - switchWindow(win_ser_local)
      # WARN: Command Not yet supported. ('assertAlert:"Doctor Name successfully created":""')

  Add_Doctor-Http:
    headers:
      User-Agent: 'Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/84.0.4147.89 Safari/537.36'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'http://localhost:3000/addDoctor'
            method: GET
            label: 'http://localhost:3000/addDoctor'
            think-time: 0ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9'
              Sec-Fetch-Site: same-origin
              Sec-Fetch-Mode: navigate
              Sec-Fetch-User: '?1'
              Sec-Fetch-Dest: document
          - url: 'http://localhost:3000/favicon.ico'
            method: HEAD
            label: 'http://localhost:3000/favicon.ico'
            headers:
              Accept: '*/*'
          - url: 'http://localhost:3000/sockjs-node/info'
            method: GET
            label: 'http://localhost:3000/sockjs-node/info'
            headers:
              Accept: '*/*'
            body:
              t: '1595531525899'