test/Add_patient-Combined-JMeter-and-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: Add_patient-Selenium
  blazegrid: true
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: Add_patient-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  Add_patient-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - resizeWindow(1280,920)
      - go(http://localhost:3000/)
      - clickByLinkText(Add Patient)
      - clickByID(patientAddress)
      - typeByID(patientAddress): "0x51c9D30C44eb81cF16be42ABad3ffbC4a38c291f"
      - clickByID(patientName)
      - typeByID(patientName): "Name"
      - typeByID(patientEmail): "email@email"
      - typeByID(password): "pass"
      - clickByCSS(button.btn.btn-primary)
      - openWindow()
      - switchWindow(win_ser_1)
      - closeWindow(win_ser_1)
      - switchWindow(win_ser_local)
      # WARN: Command Not yet supported. ('assertAlert:"Name's record successfully created":""')

  Add_patient-Http:
    headers:
      User-Agent: 'Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/84.0.4147.89 Safari/537.36'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'http://localhost:3000/addPatient'
            method: GET
            label: 'http://localhost:3000/addPatient'
            think-time: 0ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9'
              Sec-Fetch-Site: same-origin
              Sec-Fetch-Mode: navigate
              Sec-Fetch-User: '?1'
              Sec-Fetch-Dest: document
          - url: 'http://localhost:3000/favicon.ico'
            method: HEAD
            label: 'http://localhost:3000/favicon.ico'
            headers:
              Accept: '*/*'
          - url: 'http://localhost:3000/sockjs-node/info'
            method: GET
            label: 'http://localhost:3000/sockjs-node/info'
            headers:
              Accept: '*/*'
            body:
              t: '1595531382247'
          - url: 'https://ipfs.infura.io:5001/api/v0/add?stream-channels=true&progress=false'
            method: POST
            label: 'https://ipfs.infura.io:5001/api/v0/add?stream-channels=true&progress=false'
            headers:
              content-type: multipart/form-data; boundary=-----------------------------CY71_yRTrhGf_VbzLQEml
              Accept: '*/*'
            body:
              file: ''