test/view_patient-Combined-JMeter-and-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: view_patient-Selenium
  blazegrid: true
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: view_patient-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  view_patient-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - resizeWindow(1280,871)
      - go(http://localhost:3000/)
      - clickByLinkText(View Patient)
      - clickByName(patientAddress)
      - typeByName(patientAddress): "0x9046F6D40ACCa1668Ac3047275a31252A6D1B711"
      - clickByCSS(button.btn.btn-primary)

  view_patient-Http:
    headers:
      User-Agent: 'Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/84.0.4147.89 Safari/537.36'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'http://localhost:3000/viewPatient'
            method: GET
            label: 'http://localhost:3000/viewPatient'
            think-time: 0ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9'
              Sec-Fetch-Site: same-origin
              Sec-Fetch-Mode: navigate
              Sec-Fetch-User: '?1'
              Sec-Fetch-Dest: document
          - url: 'http://localhost:3000/favicon.ico'
            method: HEAD
            label: 'http://localhost:3000/favicon.ico'
            headers:
              Accept: '*/*'
          - url: 'http://localhost:3000/sockjs-node/info'
            method: GET
            label: 'http://localhost:3000/sockjs-node/info'
            headers:
              Accept: '*/*'
            body:
              t: '1595531634060'
          - url: 'http://localhost:3000/sockjs-node/261/t140h0kb/xhr_streaming?t=1595531635532'
            method: POST
            label: 'http://localhost:3000/sockjs-node/261/t140h0kb/xhr_streaming?t=1595531635532'
            headers:
              Accept: '*/*'
          - url: 'https://ipfs.infura.io/ipfs/QmQj8m5U5hobLGvmQruKFWTghWRepChbGQ6G51Tkyc1UgA'
            method: GET
            label: 'https://ipfs.infura.io/ipfs/QmQj8m5U5hobLGvmQruKFWTghWRepChbGQ6G51Tkyc1UgA'
            headers:
              Accept: '*/*'